# Задача 2: Найдите сумму цифр трехзначного числа.

num = 123

print(num // 100 + num % 100 // 10 + num % 10)